jorgebucaran/fisher
gazorby/fish-abbreviation-tips
patrickf3139/colored-man-pages
evanlucas/fish-kubectl-completions
oh-my-fish/plugin-bang-bang
jhillyerd/plugin-git
patrickf1/fzf.fish
jethrokuan/z
franciscolourenco/done
jorgebucaran/autopair.fish
