# Taps
tap "Azure/kubelogin"
tap "FelixKratz/formulae"
tap "jstkdng/programs"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "morantron/tmux-fingers"

# Taps for AWS tools
tap "common-fate/granted"

# CLI Tools
brew "zsh-vi-mode"
brew "bat"
brew "git-delta"
brew "eza"
brew "zoxide"
brew "fd"
brew "stow"
brew "direnv"
brew "mise"
brew "kubie"
brew "starship"
brew "fzf"
brew "ripgrep"
brew "neovim"
brew "tmux"
brew "morantron/tmux-fingers/tmux-fingers"
brew "thefuck"
brew "atuin"
brew "lazygit"
brew "lazydocker"
brew "fish"
brew "terraform"
brew "terraform-docs"
brew "asdf"
brew "stylua"
brew "black"
brew "isort"
brew "node"
brew "pnpm"
brew "oven-sh/bun/bun"
brew "python@3.11"
brew "go"
brew "rust"
brew "crystal"
brew "awscli"
brew "granted"
brew "kubectl"
brew "azure-cli"
brew "imagemagick"
brew "Azure/kubelogin/kubelogin"
brew "ueberzugpp"
brew "reattach-to-user-namespace"
brew "bottom"
brew "fastfetch"
brew "uv"
brew "onefetch"
brew "tealdeer"
brew "glow"
brew "jq"
brew "yq"
brew "shellcheck"
brew "shfmt"
brew "gh"
brew "pipx"
brew "gemini-cli"

# Security Tools
tap "vet-run/vet"
brew "vet-run/vet/vet-run"

# Nerd Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"

# GUI Applications
cask "ghostty"
cask "wezterm"
cask "visual-studio-code"
cask "aerospace"
cask "session-manager-plugin"
cask "raycast"
brew "sketchybar"
