# Taps
tap "Azure/kubelogin"
tap "FelixKratz/formulae"
tap "jstkdng/programs"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "morantron/tmux-fingers"

# Taps for AWS tools
tap "common-fate/granted"
tap "keidarcy/tap"

# Taps for DevOps tools
tap "fluxcd/tap"
tap "fairwindsops/tap"
# tap "gruntwork-io/tap" # Not available via tap - removed

# Tap for Splash log colorizer
tap "joshi4/splash"

# CLI Tools
brew "zsh-vi-mode"
brew "bat"
brew "git-delta"
brew "eza"
brew "zoxide"
brew "fd"
brew "stow"
brew "direnv"
brew "mise"
brew "kubie"
brew "starship"
brew "fzf"
brew "ripgrep"
brew "neovim"
brew "tree-sitter-cli"  # Required for nvim-treesitter
brew "tmux"
brew "morantron/tmux-fingers/tmux-fingers"
brew "thefuck"
brew "atuin"
brew "carapace"  # Multi-shell completion generator
# brew "lazygit"  # Removed - not using LazyGit
brew "lazydocker"
brew "yazi"
brew "ffmpegthumbnailer"  # For video thumbnails in yazi
brew "unar"  # For archive preview in yazi
brew "splash"  # Log colorizer
brew "fish"
brew "fswatch"  # For Obsidian auto-sync
brew "terraform"
brew "terraform-docs"
brew "asdf"
brew "stylua"
brew "tmuxinator"
brew "black"
brew "isort"
brew "node"
brew "pnpm"
brew "oven-sh/bun/bun"
brew "python@3.11"
brew "go"
brew "rust"
brew "crystal"
brew "awscli"
brew "granted"
brew "keidarcy/tap/e1s"  # Easy AWS ECS CLI (like k9s for ECS)
brew "kubectl"
brew "azure-cli"
brew "imagemagick"
brew "Azure/kubelogin/kubelogin"
brew "ueberzugpp"
brew "reattach-to-user-namespace"
brew "bottom"
brew "htop"
brew "btop"
brew "bandwhich"
brew "procs"
brew "doggo"
brew "fastfetch"
brew "uv"
brew "onefetch"
brew "tealdeer"
brew "glow"
brew "jq"
brew "yq"
brew "graphviz"  # Required for aws-diagram-mcp-server
brew "w3m"       # For tmpmail HTML email rendering
brew "curl"      # For tmpmail API calls
brew "urlview"   # For tmux-urlview plugin to extract and open URLs
brew "extract_url"  # Alternative URL extractor for tmux-urlview (more reliable)
brew "shellcheck"
brew "shfmt"
brew "gh"
brew "pipx"
brew "gemini-cli"
brew "mas"  # Mac App Store CLI

# AI Tools
# Claude Code - requires manual installation via official installer (https://claude.ai/download)
# Claude Code Router - installed via npm globally in setup script for alternative AI providers
# OpenAI Codex CLI - installed via npm globally in setup script
cask "amazon-q"  # Amazon Q Developer CLI

# File System Tools
# FUSE-T - kext-less FUSE implementation for macOS (replacement for macFUSE)
tap "macos-fuse-t/homebrew-cask"
cask "fuse-t"
cask "fuse-t-sshfs"

# Security & DevSecOps Tools
tap "vet-run/vet"
tap "aquasecurity/trivy"
tap "anchore/grype"
tap "anchore/syft"
brew "vet-run/vet/vet-run"
brew "gitleaks"
brew "trivy"
brew "cosign"
brew "syft"
brew "grype"
brew "tfsec"
brew "checkov"
brew "semgrep"
brew "nuclei"
brew "sops"
brew "age"
brew "hadolint"

# Observability & Monitoring Tools
brew "k9s"
brew "stern"
brew "dive"
brew "ctop"
brew "duf"
brew "gping"
brew "hyperfine"
brew "oha"
brew "glances"
brew "lnav"

# DevOps/SRE Essentials
brew "helm"
brew "kustomize"
brew "velero"
brew "argocd"
brew "fluxcd/tap/flux"
brew "terragrunt"
brew "tflint"
brew "infracost"
# brew "cloud-nuke" # Not available - install manually via go

# Network & Connectivity Tools
brew "mtr"
brew "nmap"
brew "tcpdump"
brew "httpie"
brew "curlie"
brew "xh"
brew "grpcurl"
cask "ngrok"
# cask "wireshark" # Requires sudo - install manually

# Better File/System Tools
brew "dust"
brew "sd"
brew "choose"
brew "tokei"
brew "ncdu"

# Infrastructure Tools
brew "pulumi"
# brew "packer" # License changed to BUSL - install manually if needed
# brew "vault" # License changed to BUSL - install manually if needed
# brew "consul" # License changed to BUSL - install manually if needed
# brew "nomad" # License changed to BUSL - install manually if needed

# Kubernetes Local Development Tools
brew "minikube"  # Full Kubernetes in VM/Docker
brew "k3d"       # k3s in Docker (lightweight)
brew "kind"      # Kubernetes in Docker
brew "kubectx"   # Quick context switching
brew "kubens"    # Quick namespace switching

# Container Tools
brew "podman"
# brew "buildah" # Not available on macOS
brew "skopeo"

# Performance & Debugging Tools
brew "flamegraph"
brew "wrk"
brew "watchexec"
brew "entr"

# Document Processing
cask "mactex-no-gui"  # LaTeX compiler for CV generation

# CI/CD & Automation Tools
brew "act"
brew "commitizen"
# brew "semantic-release" # Install via npm instead

# Development Tools
brew "just"
brew "task"
brew "jj"  # Jujutsu version control system

# Nerd Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"

# GUI Applications
cask "wezterm"
cask "session-manager-plugin"
cask "altair-graphql-client"  # GraphQL IDE for testing and development
cask "willow"  # Voice assistant application - https://willowvoice.com/
brew "sketchybar"

# Mac App Store Applications
mas "Kinda Vim for Safari", id: 1609556629
