# Taps
tap "Azure/kubelogin"
tap "FelixKratz/formulae"
tap "jstkdng/programs"
tap "nikitabobko/tap"
tap "oven-sh/bun"
# tap "morantron/tmux-fingers"  # Removed - using tmux-thumbs via TPM instead

# Taps for AWS tools
tap "common-fate/granted"

# Taps for DevOps tools
tap "fluxcd/tap"
tap "fairwindsops/tap"
# tap "gruntwork-io/tap" # Not available via tap - removed

# Tap for Atlassian CLI
tap "atlassian/homebrew-acli"

# Tap for Splash log colorizer
tap "joshi4/splash"

# Tap for Opencode AI coding agent (anomalyco fork)
tap "anomalyco/tap"

# Tap for Recall - Claude Code conversation search
tap "zippoxer/tap"

# Tap for Linear CLI
tap "schpet/tap"

# Tap for Graphite CLI (stacked PRs and merge queue)
tap "withgraphite/tap"

# Tap for Entire CLI (AI agent session checkpoints)
tap "entireio/tap"

# Tap for Homebrew background auto-updates
tap "DomT4/autoupdate"

# System Maintenance
brew "topgrade"  # Unified system updater - updates Homebrew, pip, cargo, npm, mas, etc. in one command

# CLI Tools
brew "zsh-vi-mode"
# Bash enhancements
brew "bash-completion@2"  # Programmable completion for Bash 4.2+ (matches modern Homebrew bash)
brew "bash-git-prompt"    # Git-aware bash prompt (alternative to Starship for pure bash environments)
brew "bat"
brew "git-delta"
brew "eza"
brew "zoxide"
brew "fd"
brew "coreutils"  # Provides gtimeout; macOS lacks GNU timeout. Hooks fall back to gtimeout.
brew "stow"
brew "direnv"
brew "mise"
brew "kubie"
brew "starship"
brew "fzf"
brew "ripgrep"
brew "neovim"
brew "tree-sitter-cli"  # Required for nvim-treesitter
brew "luarocks"  # For installing Lua dependencies (e.g., sqlite.lua for telescope-smart-history)
brew "tmux"
# brew "morantron/tmux-fingers/tmux-fingers"  # Removed - using tmux-thumbs via TPM instead
brew "thefuck"
brew "atuin"
brew "asciinema"  # Terminal session recorder
brew "vhs"  # Terminal GIF recorder with code-based recording
brew "carapace"  # Multi-shell completion generator
# brew "lazygit"  # Removed - not using LazyGit
brew "lazydocker"
brew "splash"  # Log colorizer
brew "fish"
brew "fswatch"  # For Obsidian auto-sync
brew "terraform"
brew "terraform-docs"
brew "asdf"
brew "stylua"
brew "tmuxinator"
brew "black"
brew "isort"
brew "node"
brew "pnpm"
brew "oven-sh/bun/bun"
brew "python@3.11"
brew "go"
brew "rust"
brew "crystal"
brew "awscli"
brew "granted"
brew "kubectl"
brew "kubecolor"  # Colorized kubectl output (logs, get, describe)
brew "kubent"     # Kubernetes deprecation checker (Alt+K in FZF)
brew "krew"       # kubectl plugin manager (Alt+G requires get-all plugin)
brew "trivy"      # Container image vulnerability scanner (Alt+T in FZF)
brew "azure-cli"
brew "imagemagick"
brew "Azure/kubelogin/kubelogin"
# brew "reattach-to-user-namespace"  # Removed: not needed since macOS 12 (Monterey), and causes tmux-sensible to override default-command
brew "bottom"
brew "htop"
brew "btop"
brew "bandwhich"
brew "procs"
brew "doggo"
brew "fastfetch"
brew "uv"
brew "onefetch"
brew "jq"
brew "yq"
brew "jwt-cli"   # JWT encoder/decoder CLI
brew "fx"        # Interactive JSON explorer
brew "redis"  # Required for Pulse coding activity tracking
brew "graphviz"  # Required for aws-diagram-mcp-server
brew "w3m"       # For tmpmail HTML email rendering
brew "curl"      # For tmpmail API calls
brew "urlview"   # For tmux-urlview plugin to extract and open URLs
brew "extract_url"  # Alternative URL extractor for tmux-urlview (more reliable)
brew "shellcheck"
brew "shfmt"
brew "ruff"
brew "gh"
brew "glab"                    # GitLab CLI
brew "pipx"
brew "gemini-cli"
brew "mas"  # Mac App Store CLI

# AI Tools
# claude-code: installed via native `claude install` (see scripts/bin/claude)
# Installer invocation lives in scripts/setup.sh (native fallback to bunx bootstrap)
# devcontainer.vim - Neovim in any devcontainer (installed via go install in setup.sh)
cask "1password-cli"  # 1Password CLI for tmux-1password plugin
# Claude Code Router - installed via npm globally in setup script for alternative AI providers
# OpenAI Codex CLI - installed via npm globally in setup script
cask "kiro-cli"  # Kiro CLI (formerly Amazon Q Developer)
brew "anomalyco/tap/opencode"  # AI coding agent built for the terminal (anomalyco fork)
brew "zippoxer/tap/recall"  # Search and resume Claude Code conversations
brew "openclaw-cli"  # Self-hosted personal AI assistant gateway CLI
brew "agent-browser"  # AI-optimized headless browser automation CLI (ref-based interaction model)
# pinchtab: installed via curl installer (multi-instance Chrome orchestrator for AI agents)
# Install: curl -fsSL https://pinchtab.com/install.sh | bash
# cask "openclaw"  # macOS app (optional - enable if you want the menu bar companion)

# Self-Hosted LLM Tools (resilience if cloud AI goes down)
cask "ollama"  # Local LLM runtime - runs Llama, DeepSeek, Codestral, etc.
# Open WebUI - installed via pip in scripts/setup-selfhost-llm.sh

# File System Tools
# FUSE-T - kext-less FUSE implementation for macOS (replacement for macFUSE)
tap "macos-fuse-t/homebrew-cask"
cask "fuse-t"
cask "fuse-t-sshfs"

# Security & DevSecOps Tools
tap "vet-run/vet"
tap "aquasecurity/trivy"
tap "anchore/grype"
tap "anchore/syft"
brew "vet-run/vet/vet-run"
brew "gitleaks"
brew "trivy"
brew "cosign"
brew "syft"
brew "grype"
brew "tfsec"
brew "checkov"
brew "semgrep"
brew "nuclei"
brew "sops"
brew "age"
brew "hadolint"
brew "popeye"    # Kubernetes cluster scanner
brew "conftest"  # Policy testing with OPA/Rego

# Code Quality Tools
brew "sonar-scanner"  # SonarQube scanner CLI for local code quality analysis

# Observability & Monitoring Tools
brew "stern"
brew "dive"
brew "ctop"
brew "duf"
brew "gping"
brew "hyperfine"
brew "oha"
brew "glances"
brew "lnav"

# Atlassian Tools
brew "acli"  # Official Atlassian CLI for Jira, Confluence, Admin

# Issue Tracking CLIs
brew "schpet/tap/linear"  # Linear CLI for personal projects (agent-friendly)
brew "beads"              # Git-backed agent memory / issue tracker (steveyegge/beads)
brew "dolt"               # Version-controlled SQL database (beads backend)
brew "entireio/tap/entire"  # AI agent session checkpoints (replaces custom checkpoints.sh)
brew "withgraphite/tap/graphite"  # Graphite CLI for stacked PRs and merge queue

# DevOps/SRE Essentials
brew "helm"
brew "kustomize"
brew "velero"
brew "argocd"
brew "fluxcd/tap/flux"
brew "terragrunt"
brew "tflint"
brew "infracost"
# brew "cloud-nuke" # Not available - install manually via go

# Network & Connectivity Tools
brew "mtr"
brew "nmap"
brew "tcpdump"
brew "httpie"
brew "curlie"
brew "xh"
brew "grpcurl"
cask "ngrok"
# cask "wireshark" # Requires sudo - install manually

# Better File/System Tools
brew "dust"
brew "sd"
brew "choose-rust"
brew "tokei"
brew "ncdu"

# Terminal File Manager
brew "yazi"              # Blazing fast terminal file manager (Rust)
brew "ffmpegthumbnailer" # Video thumbnails for yazi
brew "unar"              # Archive preview for yazi
brew "poppler"           # PDF preview for yazi

# Keyboard & Display Tools

cask "keycastr"  # Keystroke visualizer for screencasts and presentations

# Clipboard Manager
# CopyQ is installed via GitHub releases (not Homebrew) due to Gatekeeper deprecation
# See: scripts/setup/setup-copyq.sh

# Infrastructure Tools
brew "pulumi"
# brew "packer" # License changed to BUSL - install manually if needed
# brew "vault" # License changed to BUSL - install manually if needed
# brew "consul" # License changed to BUSL - install manually if needed
# brew "consul-template" # HashiCorp BUSL license - install manually via setup script
# brew "nomad" # License changed to BUSL - install manually if needed

# Kubernetes Local Development Tools
brew "minikube"  # Full Kubernetes in VM/Docker
brew "k3d"       # k3s in Docker (lightweight)
brew "kind"      # Kubernetes in Docker
brew "kubectx"   # Quick context/namespace switching (includes kubens)

# Container Tools
brew "colima"    # Container runtime for macOS
brew "devcontainer"  # Dev Containers CLI for worktree/devcontainer integration
# brew "buildah" # Not available on macOS
brew "skopeo"

# Performance & Debugging Tools
brew "flamegraph"
brew "wrk"
brew "watchexec"
brew "entr"

# Document Processing
brew "pandoc"  # Document format converter (required for OVIWrite)
brew "typst"  # Modern typesetting system (LaTeX alternative) for invoices, docs, presentations

# CI/CD & Automation Tools
brew "act"
brew "commitizen"
brew "openjdk"  # Required for Jenkins CLI (jenkins-cli.jar)
# brew "semantic-release" # Install via npm instead

# Development Tools
brew "just"
brew "task"
brew "jj"  # Jujutsu version control system

# Nerd Fonts
# Note: DankMono Nerd Font is manually installed from https://github.com/saifulapm/my-fonts
# Primary: DankMono Nerd Font (manual installation)
# Fallback: JetBrains Mono Nerd Font, Iosevka Nerd Font
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"

# GUI Applications
cask "wezterm"
cask "session-manager-plugin"

# Mac App Store Applications
